reports/ws_prem20[20]_local[0]_1ser[15pool]_3000tunn_5inst_1000user_1m_1sec.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: tunnels.js
     output: -

  scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m30s max duration (incl. graceful stop):
           * default: 1000 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 1000 VUs  0m00.7s/1m0s

running (0m01.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  0m01.7s/1m0s

running (0m02.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1000 VUs  0m02.7s/1m0s

running (0m03.7s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 1000 VUs  0m03.7s/1m0s

running (0m04.7s), 1000/1000 VUs, 9 complete and 0 interrupted iterations
default   [   8% ] 1000 VUs  0m04.7s/1m0s

running (0m05.7s), 1000/1000 VUs, 118 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  0m05.7s/1m0s

running (0m06.7s), 1000/1000 VUs, 329 complete and 0 interrupted iterations
default   [  11% ] 1000 VUs  0m06.7s/1m0s

running (0m07.7s), 1000/1000 VUs, 679 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  0m07.7s/1m0s

running (0m08.7s), 1000/1000 VUs, 1141 complete and 0 interrupted iterations
default   [  15% ] 1000 VUs  0m08.7s/1m0s

running (0m09.7s), 1000/1000 VUs, 1475 complete and 0 interrupted iterations
default   [  16% ] 1000 VUs  0m09.7s/1m0s

running (0m10.7s), 1000/1000 VUs, 1545 complete and 0 interrupted iterations
default   [  18% ] 1000 VUs  0m10.7s/1m0s

running (0m11.7s), 1000/1000 VUs, 1718 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  0m11.7s/1m0s

running (0m12.7s), 1000/1000 VUs, 2240 complete and 0 interrupted iterations
default   [  21% ] 1000 VUs  0m12.7s/1m0s

running (0m13.7s), 1000/1000 VUs, 2695 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  0m13.7s/1m0s

running (0m14.7s), 1000/1000 VUs, 2875 complete and 0 interrupted iterations
default   [  25% ] 1000 VUs  0m14.7s/1m0s

running (0m15.7s), 1000/1000 VUs, 3223 complete and 0 interrupted iterations
default   [  26% ] 1000 VUs  0m15.7s/1m0s

running (0m16.7s), 1000/1000 VUs, 3718 complete and 0 interrupted iterations
default   [  28% ] 1000 VUs  0m16.7s/1m0s

running (0m17.7s), 1000/1000 VUs, 3946 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  0m17.7s/1m0s

running (0m18.7s), 1000/1000 VUs, 4341 complete and 0 interrupted iterations
default   [  31% ] 1000 VUs  0m18.7s/1m0s

running (0m19.7s), 1000/1000 VUs, 4873 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  0m19.7s/1m0s

running (0m20.7s), 1000/1000 VUs, 5168 complete and 0 interrupted iterations
default   [  35% ] 1000 VUs  0m20.7s/1m0s

running (0m21.7s), 1000/1000 VUs, 5407 complete and 0 interrupted iterations
default   [  36% ] 1000 VUs  0m21.7s/1m0s

running (0m22.7s), 1000/1000 VUs, 5600 complete and 0 interrupted iterations
default   [  38% ] 1000 VUs  0m22.7s/1m0s

running (0m23.7s), 1000/1000 VUs, 6211 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  0m23.7s/1m0s

running (0m24.7s), 1000/1000 VUs, 6753 complete and 0 interrupted iterations
default   [  41% ] 1000 VUs  0m24.7s/1m0s

running (0m25.7s), 1000/1000 VUs, 7068 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  0m25.7s/1m0s

running (0m26.7s), 1000/1000 VUs, 7548 complete and 0 interrupted iterations
default   [  45% ] 1000 VUs  0m26.7s/1m0s

running (0m27.7s), 1000/1000 VUs, 7921 complete and 0 interrupted iterations
default   [  46% ] 1000 VUs  0m27.7s/1m0s

running (0m28.7s), 1000/1000 VUs, 8218 complete and 0 interrupted iterations
default   [  48% ] 1000 VUs  0m28.7s/1m0s

running (0m29.7s), 1000/1000 VUs, 8730 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  0m29.7s/1m0s

running (0m30.7s), 1000/1000 VUs, 9414 complete and 0 interrupted iterations
default   [  51% ] 1000 VUs  0m30.7s/1m0s

running (0m31.7s), 1000/1000 VUs, 9852 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  0m31.7s/1m0s

running (0m32.7s), 1000/1000 VUs, 10447 complete and 0 interrupted iterations
default   [  55% ] 1000 VUs  0m32.7s/1m0s

running (0m33.7s), 1000/1000 VUs, 10932 complete and 0 interrupted iterations
default   [  56% ] 1000 VUs  0m33.7s/1m0s

running (0m34.7s), 1000/1000 VUs, 11326 complete and 0 interrupted iterations
default   [  58% ] 1000 VUs  0m34.7s/1m0s

running (0m35.7s), 1000/1000 VUs, 11685 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  0m35.7s/1m0s

running (0m36.7s), 1000/1000 VUs, 12085 complete and 0 interrupted iterations
default   [  61% ] 1000 VUs  0m36.7s/1m0s

running (0m37.7s), 1000/1000 VUs, 12468 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  0m37.7s/1m0s

running (0m38.7s), 1000/1000 VUs, 13012 complete and 0 interrupted iterations
default   [  65% ] 1000 VUs  0m38.7s/1m0s

running (0m39.7s), 1000/1000 VUs, 13358 complete and 0 interrupted iterations
default   [  66% ] 1000 VUs  0m39.7s/1m0s

running (0m40.7s), 1000/1000 VUs, 13861 complete and 0 interrupted iterations
default   [  68% ] 1000 VUs  0m40.7s/1m0s

running (0m41.7s), 1000/1000 VUs, 14232 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  0m41.7s/1m0s

running (0m42.7s), 1000/1000 VUs, 14690 complete and 0 interrupted iterations
default   [  71% ] 1000 VUs  0m42.7s/1m0s

running (0m43.7s), 1000/1000 VUs, 15330 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  0m43.7s/1m0s

running (0m44.7s), 1000/1000 VUs, 15624 complete and 0 interrupted iterations
default   [  75% ] 1000 VUs  0m44.7s/1m0s

running (0m45.7s), 1000/1000 VUs, 16021 complete and 0 interrupted iterations
default   [  76% ] 1000 VUs  0m45.7s/1m0s

running (0m46.7s), 1000/1000 VUs, 16741 complete and 0 interrupted iterations
default   [  78% ] 1000 VUs  0m46.7s/1m0s

running (0m47.7s), 1000/1000 VUs, 17205 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  0m47.7s/1m0s

running (0m48.7s), 1000/1000 VUs, 17821 complete and 0 interrupted iterations
default   [  81% ] 1000 VUs  0m48.7s/1m0s

running (0m49.7s), 1000/1000 VUs, 18357 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  0m49.7s/1m0s

running (0m50.7s), 1000/1000 VUs, 18664 complete and 0 interrupted iterations
default   [  85% ] 1000 VUs  0m50.7s/1m0s

running (0m51.7s), 1000/1000 VUs, 19101 complete and 0 interrupted iterations
default   [  86% ] 1000 VUs  0m51.7s/1m0s

running (0m52.7s), 1000/1000 VUs, 19887 complete and 0 interrupted iterations
default   [  88% ] 1000 VUs  0m52.7s/1m0s

running (0m53.7s), 1000/1000 VUs, 20380 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  0m53.7s/1m0s

running (0m54.7s), 1000/1000 VUs, 21118 complete and 0 interrupted iterations
default   [  91% ] 1000 VUs  0m54.7s/1m0s

running (0m55.7s), 1000/1000 VUs, 21500 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  0m55.7s/1m0s

running (0m56.7s), 1000/1000 VUs, 21978 complete and 0 interrupted iterations
default   [  95% ] 1000 VUs  0m56.7s/1m0s

running (0m57.7s), 1000/1000 VUs, 22566 complete and 0 interrupted iterations
default   [  96% ] 1000 VUs  0m57.7s/1m0s

running (0m58.7s), 1000/1000 VUs, 23115 complete and 0 interrupted iterations
default   [  98% ] 1000 VUs  0m58.7s/1m0s

running (0m59.7s), 1000/1000 VUs, 23756 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  0m59.7s/1m0s

running (1m00.7s), 0540/1000 VUs, 24283 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m01.6s), 0000/1000 VUs, 24823 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  1m0s

     ✓ status is 200

     checks.........................: 100.00% ✓ 24823      ✗ 0     
     data_received..................: 77 MB   1.2 MB/s
     data_sent......................: 7.1 MB  116 kB/s
     http_req_blocked...............: avg=356.63ms min=162ns    med=613ns    max=4.74s   p(90)=960.38ms p(95)=1.2s    
     http_req_connecting............: avg=161.62ms min=0s       med=0s       max=1.89s   p(90)=452.1ms  p(95)=559.41ms
     http_req_duration..............: avg=1.02s    min=238.11ms med=765.55ms max=11.69s  p(90)=1.67s    p(95)=2.54s   
       { expected_response:true }...: avg=1.02s    min=238.11ms med=765.55ms max=11.69s  p(90)=1.67s    p(95)=2.54s   
     http_req_failed................: 0.00%   ✓ 0          ✗ 24823 
     http_req_receiving.............: avg=688.66µs min=18.55µs  med=60.34µs  max=1.59s   p(90)=861.29µs p(95)=1.74ms  
     http_req_sending...............: avg=109.12µs min=22.03µs  med=73.33µs  max=17.28ms p(90)=143.96µs p(95)=233.72µs
     http_req_tls_handshaking.......: avg=194.67ms min=0s       med=0s       max=4.6s    p(90)=509.21ms p(95)=646.64ms
     http_req_waiting...............: avg=1.02s    min=237.59ms med=764.81ms max=11.69s  p(90)=1.67s    p(95)=2.54s   
     http_reqs......................: 24823   402.696174/s
     iteration_duration.............: avg=2.44s    min=1.24s    med=2.04s    max=13.71s  p(90)=3.4s     p(95)=4.19s   
     iterations.....................: 24823   402.696174/s
     vus............................: 545     min=545      max=1000
     vus_max........................: 1000    min=1000     max=1000